<template>
<div class="App">
<post-form @create= "CreatePost"/>
<post-list 
v-model:posts="posts"
v-on:addmr= 'addmark'

/>
</div>
</template>
<script>

import PostList from "@/componets/PostList"

export default {
    components:{
PostList 
    },
    data(){
        return {
            posts:[
                {id:1  ,rating: 4.5 , image : require('@/image/John_Wick_4_poster.jpg') , price : 230 , title: 'Джон уик 4' , body:'Оставляя за собой горы трупов, Джон Уик продолжает скрываться от всевозможных наёмных убийц, и теперь охоту на него возглавляет молодой и честолюбивый член Правления по имени Маркиз. Два управляющих отелями «Континенталь» в Нью-Йорке и Осаке, решившие по старой дружбе помочь своенравному киллеру, уже жестоко за это поплатились, но внезапно Джон узнаёт способ выбраться из этой, казалось бы, безвыходной ситуации. '},
                {id:2 ,rating: 4.5  , image : require('@/image/movie-poster.jpg') ,  price : 210 , title: 'Мстители:финал' , body:'Оставшиеся в живых члены команды Мстителей и их союзники должны разработать новый план, который поможет противостоять разрушительным действиям могущественного титана Таноса. После наиболее масштабной и трагической битвы в истории они не могут допустить ошибку. '},  
                {id:3 ,rating: 4.5  , price : 250 , title: 'Зеленая миля ' , body:'Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока. '},  
                {id:4  ,rating: 4.5 , price : 100 , title: 'Остров проклятых ' , body:'Два американских судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных преступников. При проведении расследования им придется столкнуться с паутиной лжи, обрушившимся ураганом и смертельным бунтом обитателей клиники. '},  
                {id:5 ,rating: 4.5  , price : 300 , title: 'Однажды в голливуде ' , body:'1969 год, золотой век Голливуда уже закончился. Известный актёр Рик Далтон и его дублер Клифф Бут пытаются найти свое место в стремительно меняющемся мире киноиндустрии. '},  
                {id:6 , price : 150 , title: 'Бойцовский клуб' , body:'Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить, — саморазрушение. '},  
             ], 

        }
    }, 
    methods:{
        addmark(mark , id){
            console.log(" xnj nj",mark)
        }
    }
}
</script>
<style >

</style>